aroyer-qc/Digini/Peripheral/inc/port/STM32F4xx/lib_class_STM32F4_fmc.h
#define IS_FMC_NAND_BANK(BANK)                          ((BANK) == FMC_NAND_BANK3)

#define IS_FMC_WAIT_FEATURE(FEATURE)                    (((FEATURE) == FMC_NAND_WAIT_FEATURE_DISABLE) || \
                                                         ((FEATURE) == FMC_NAND_WAIT_FEATURE_ENABLE))

#define IS_FMC_NAND_MEMORY_WIDTH(WIDTH)                 (((WIDTH) == FMC_NAND_MEM_BUS_WIDTH_8) || \
                                                         ((WIDTH) == FMC_NAND_MEM_BUS_WIDTH_16))

#define IS_FMC_ECC_STATE(STATE)                         (((STATE) == FMC_NAND_ECC_DISABLE) || \
                                                         ((STATE) == FMC_NAND_ECC_ENABLE))

#define IS_FMC_ECCPAGE_SIZE(SIZE)                       (((SIZE) == FMC_NAND_ECC_PAGE_SIZE_256BYTE)  || \
                                                        ((SIZE) == FMC_NAND_ECC_PAGE_SIZE_512BYTE)  || \
                                                        ((SIZE) == FMC_NAND_ECC_PAGE_SIZE_1024BYTE) || \
                                                        ((SIZE) == FMC_NAND_ECC_PAGE_SIZE_2048BYTE) || \
                                                        ((SIZE) == FMC_NAND_ECC_PAGE_SIZE_4096BYTE) || \
                                                        ((SIZE) == FMC_NAND_ECC_PAGE_SIZE_8192BYTE))

#define IS_FMC_SDMEMORY_WIDTH(WIDTH)                    (((WIDTH) == FMC_SDRAM_MEM_BUS_WIDTH_8)  || \
                                                         ((WIDTH) == FMC_SDRAM_MEM_BUS_WIDTH_16) || \
                                                         ((WIDTH) == FMC_SDRAM_MEM_BUS_WIDTH_32))

#define IS_FMC_WRITE_PROTECTION(__WRITE__)              (((__WRITE__) == FMC_SDRAM_WRITE_PROTECTION_DISABLE) || \
                                                         ((__WRITE__) == FMC_SDRAM_WRITE_PROTECTION_ENABLE))

#define IS_FMC_SDCLOCK_PERIOD(__PERIOD__)               (((__PERIOD__) == FMC_SDRAM_CLOCK_DISABLE)  || \
                                                         ((__PERIOD__) == FMC_SDRAM_CLOCK_PERIOD_2) || \
                                                         ((__PERIOD__) == FMC_SDRAM_CLOCK_PERIOD_3))

#define IS_FMC_READ_BURST(__RBURST__)                   (((__RBURST__) == FMC_SDRAM_RBURST_DISABLE) || \
                                                         ((__RBURST__) == FMC_SDRAM_RBURST_ENABLE))

#define IS_FMC_READPIPE_DELAY(__DELAY__)                (((__DELAY__) == FMC_SDRAM_RPIPE_DELAY_0) || \
                                                         ((__DELAY__) == FMC_SDRAM_RPIPE_DELAY_1) || \
                                                         ((__DELAY__) == FMC_SDRAM_RPIPE_DELAY_2))

#define IS_FMC_COMMAND_MODE(__COMMAND__)                (((__COMMAND__) == FMC_SDRAM_CMD_NORMAL_MODE)      || \
                                                         ((__COMMAND__) == FMC_SDRAM_CMD_CLK_ENABLE)       || \
                                                         ((__COMMAND__) == FMC_SDRAM_CMD_PALL)             || \
                                                         ((__COMMAND__) == FMC_SDRAM_CMD_AUTOREFRESH_MODE) || \
                                                         ((__COMMAND__) == FMC_SDRAM_CMD_LOAD_MODE)        || \
                                                         ((__COMMAND__) == FMC_SDRAM_CMD_SELFREFRESH_MODE) || \
                                                         ((__COMMAND__) == FMC_SDRAM_CMD_POWERDOWN_MODE))

#define IS_FMC_COMMAND_TARGET(__TARGET__)               (((__TARGET__) == FMC_SDRAM_CMD_TARGET_BANK1) || \
                                                         ((__TARGET__) == FMC_SDRAM_CMD_TARGET_BANK2) || \
                                                         ((__TARGET__) == FMC_SDRAM_CMD_TARGET_BANK1_2))

#define IS_FMC_TCLR_TIME(__TIME__)                      ((__TIME__) <= 255)             // FMC_TCLR_Setup_Time FMC TCLR Setup Time
#define IS_FMC_TAR_TIME(TIME)                           ((TIME) <= 255)                 // FMC_TAR_Setup_Time FMC TAR Setup Time
#define IS_FMC_SETUP_TIME(TIME)                         ((TIME) <= 254)                 // FMC_Setup_Time FMC Setup Time
#define IS_FMC_WAIT_TIME(TIME)                          ((TIME) <= 254)                 // FMC_Wait_Setup_Time FMC Wait Setup Time
#define IS_FMC_HOLD_TIME(TIME)                          ((TIME) <= 254)                 // FMC_Hold_Setup_Time FMC Hold Setup Time
#define IS_FMC_HIZ_TIME(TIME)                           ((TIME) <= 254)                 // FMC_HiZ_Setup_Time FMC HiZ Setup Time


#define IS_FMC_BURSTMODE(__STATE__)                     (((__STATE__) == FMC_BURST_ACCESS_MODE_DISABLE) ||      \
                                                         ((__STATE__) == FMC_BURST_ACCESS_MODE_ENABLE))

#define IS_FMC_WAIT_POLARITY(__POLARITY__)              (((__POLARITY__) == FMC_WAIT_SIGNAL_POLARITY_LOW) ||    \
                                                         ((__POLARITY__) == FMC_WAIT_SIGNAL_POLARITY_HIGH))

#define IS_FMC_WAIT_SIGNAL_ACTIVE(__ACTIVE__)           (((__ACTIVE__) == FMC_WAIT_TIMING_BEFORE_WS) ||         \
                                                         ((__ACTIVE__) == FMC_WAIT_TIMING_DURING_WS))

#define IS_FMC_WRITE_OPERATION(__OPERATION__)           (((__OPERATION__) == FMC_WRITE_OPERATION_DISABLE) ||    \
                                                         ((__OPERATION__) == FMC_WRITE_OPERATION_ENABLE))

#define IS_FMC_WAITE_SIGNAL(__SIGNAL__)                 (((__SIGNAL__) == FMC_WAIT_SIGNAL_DISABLE) ||           \
                                                         ((__SIGNAL__) == FMC_WAIT_SIGNAL_ENABLE))

#define IS_FMC_EXTENDED_MODE(__MODE__)                  (((__MODE__) == FMC_EXTENDED_MODE_DISABLE) ||           \
                                                         ((__MODE__) == FMC_EXTENDED_MODE_ENABLE))

#define IS_FMC_ASYNWAIT(__STATE__)                      (((__STATE__) == FMC_ASYNCHRONOUS_WAIT_DISABLE) ||      \
                                                         ((__STATE__) == FMC_ASYNCHRONOUS_WAIT_ENABLE))

