aroyer-qc/Digini/Peripheral/inc/port/STM32F4xx/lib_class_STM32F4_fmc.h
// FMC_Data_Latency FMC Data Latency
#define IS_FMC_DATA_LATENCY(__LATENCY__)                (((__LATENCY__) > 1) && ((__LATENCY__) <= 17))


#define IS_FMC_WRITE_BURST(__BURST__)                   (((__BURST__) == FMC_WRITE_BURST_DISABLE) ||            \
                                                         ((__BURST__) == FMC_WRITE_BURST_ENABLE))

#define IS_FMC_CONTINOUS_CLOCK(CCLOCK)                  (((CCLOCK) == FMC_CONTINUOUS_CLOCK_SYNC_ONLY) ||        \
                                                         ((CCLOCK) == FMC_CONTINUOUS_CLOCK_SYNC_ASYNC))


// FMC_Address_Setup_Time FMC Address Setup Time
#define IS_FMC_ADDRESS_SETUP_TIME(__TIME__)             ((__TIME__) <= 15)
// FMC_Address_Hold_Time FMC Address Hold Time
#define IS_FMC_ADDRESS_HOLD_TIME(__TIME__)              (((__TIME__) > 0) && ((__TIME__) <= 15))
// FMC_Data_Setup_Time FMC Data Setup Time
#define IS_FMC_DATASETUP_TIME(__TIME__)                 (((__TIME__) > 0) && ((__TIME__) <= 255))
// FMC_Bus_Turn_around_Duration FMC Bus Turn around Duration
#define IS_FMC_TURNAROUND_TIME(__TIME__)                (__TIME__) <= 15)

// FMC_CLK_Division FMC CLK Division
#define IS_FMC_CLK_DIV(DIV)                             (((DIV) > 1) && ((DIV) <= 16))
// FMC_SDRAM_LoadToActive_Delay FMC SDRAM LoadToActive Delay
#define IS_FMC_LOADTOACTIVE_DELAY(__DELAY__)            (((__DELAY__) > 0) && ((__DELAY__) <= 16))
// FMC_SDRAM_ExitSelfRefresh_Delay FMC SDRAM ExitSelfRefresh Delay
#define IS_FMC_EXITSELFREFRESH_DELAY(__DELAY__)         (((__DELAY__) > 0) && ((__DELAY__) <= 16))
// FMC_SDRAM_SelfRefresh_Time FMC SDRAM SelfRefresh Time
#define IS_FMC_SELFREFRESH_TIME(__TIME__)               (((__TIME__) > 0) && ((__TIME__) <= 16))

// FMC_SDRAM_RowCycle_Delay FMC SDRAM RowCycle Delay
#define IS_FMC_ROWCYCLE_DELAY(__DELAY__)                (((__DELAY__) > 0) && ((__DELAY__) <= 16))
// FMC_SDRAM_Write_Recovery_Time FMC SDRAM Write Recovery Time
#define IS_FMC_WRITE_RECOVERY_TIME(__TIME__)            (((__TIME__) > 0) && ((__TIME__) <= 16))

// FMC_SDRAM_RP_Delay FMC SDRAM RP Delay
#define IS_FMC_RP_DELAY(__DELAY__)                      (((__DELAY__) > 0) && ((__DELAY__) <= 16))

// FMC_SDRAM_RCD_Delay FMC SDRAM RCD Delay
#define IS_FMC_RCD_DELAY(__DELAY__)                     (((__DELAY__) > 0) && ((__DELAY__) <= 16))
// FMC_SDRAM_AutoRefresh_Number FMC SDRAM AutoRefresh Number
#define IS_FMC_AUTOREFRESH_NUMBER(__NUMBER__)           (((__NUMBER__) > 0) && ((__NUMBER__) <= 16))
// FMC_SDRAM_ModeRegister_Definition FMC SDRAM ModeRegister Definition
#define IS_FMC_MODE_REGISTER(__CONTENT__)               ((__CONTENT__) <= 8191)
// FMC_SDRAM_Refresh_rate FMC SDRAM Refresh rate
#define IS_FMC_REFRESH_RATE(__RATE__)                   ((__RATE__) <= 8191)
// FMC_NORSRAM_Device_Instance FMC NORSRAM Device Instance
#define IS_FMC_NORSRAM_DEVICE(__INSTANCE__)             ((__INSTANCE__) == FMC_NORSRAM_DEVICE)

// FMC_NORSRAM_EXTENDED_Device_Instance FMC NORSRAM EXTENDED Device Instance
#define IS_FMC_NORSRAM_EXTENDED_DEVICE(__INSTANCE__)    ((__INSTANCE__) == FMC_NORSRAM_EXTENDED_DEVICE)
// FMC_NAND_Device_Instance FMC NAND Device Instance
#define IS_FMC_NAND_DEVICE(__INSTANCE__)                ((__INSTANCE__) == FMC_NAND_DEVICE)

// FMC_SDRAM_Device_Instance FMC SDRAM Device Instance
#define IS_FMC_SDRAM_DEVICE(__INSTANCE__)               ((__INSTANCE__) == FMC_SDRAM_DEVICE)

#define IS_FMC_SDRAM_BANK(BANK)                         (((BANK) == FMC_SDRAM_BANK1) || \
                                                         ((BANK) == FMC_SDRAM_BANK2))

#define IS_FMC_COLUMNBITS_NUMBER(COLUMN)                (((COLUMN) == FMC_SDRAM_COLUMN_BITS_NUM_8)  || \
                                                         ((COLUMN) == FMC_SDRAM_COLUMN_BITS_NUM_9)  || \
                                                         ((COLUMN) == FMC_SDRAM_COLUMN_BITS_NUM_10) || \
                                                         ((COLUMN) == FMC_SDRAM_COLUMN_BITS_NUM_11))

#define IS_FMC_ROWBITS_NUMBER(ROW)                      (((ROW) == FMC_SDRAM_ROW_BITS_NUM_11) || \
                                                         ((ROW) == FMC_SDRAM_ROW_BITS_NUM_12) || \
                                                         ((ROW) == FMC_SDRAM_ROW_BITS_NUM_13))

#define IS_FMC_INTERNALBANK_NUMBER(NUMBER)              (((NUMBER) == FMC_SDRAM_INTERN_BANKS_NUM_2) || \
                                                         ((NUMBER) == FMC_SDRAM_INTERN_BANKS_NUM_4))


#define IS_FMC_CAS_LATENCY(LATENCY)                     (((LATENCY) == FMC_SDRAM_CAS_LATENCY_1) || \
                                                         ((LATENCY) == FMC_SDRAM_CAS_LATENCY_2) || \
                                                         ((LATENCY) == FMC_SDRAM_CAS_LATENCY_3))

#define IS_FMC_PAGESIZE(__SIZE__)                       (((__SIZE__) == FMC_PAGE_SIZE_NONE) || \
                                                         ((__SIZE__) == FMC_PAGE_SIZE_128)  || \
                                                         ((__SIZE__) == FMC_PAGE_SIZE_256)  || \
                                                         ((__SIZE__) == FMC_PAGE_SIZE_512)  || \
                                                         ((__SIZE__) == FMC_PAGE_SIZE_1024))

#define IS_FMC_WRITE_FIFO(__FIFO__)                     (((__FIFO__) == FMC_WRITE_FIFO_DISABLE) || \
                                                         ((__FIFO__) == FMC_WRITE_FIFO_ENABLE))

// FMC_Exported_typedef FMC Low Layer Exported Types
#define FMC_NORSRAM_t                                   FMC_Bank1_TypeDef
#define FMC_NORSRAM_EXTENDED_t                          FMC_Bank1E_TypeDef
#define FMC_NAND_t                                      FMC_Bank3_TypeDef
#define FMC_SDRAM_t                                     FMC_Bank5_6_TypeDef

#define FMC_NORSRAM_DEVICE                              FMC_Bank1
#define FMC_NORSRAM_EXTENDED_DEVICE                     FMC_Bank1E
#define FMC_NAND_DEVICE                                 FMC_Bank3
#define FMC_SDRAM_DEVICE                                FMC_Bank5_6

//-------------------------------------------------------------------------------------------------
// typedef(s)
//-------------------------------------------------------------------------------------------------

// FMC NORSRAM Configuration Structure definition
struct FMC_NORSRAM_Init_t
{
  uint32_t NSBank;                       // Specifies the NORSRAM memory device that will be used. This parameter can be a value of @ref FMC_NORSRAM_Bank
  uint32_t DataAddressMux;               // Specifies whether the address and data values are multiplexed on the data bus or not. This parameter can be a value of @ref FMC_Data_Address_Bus_Multiplexing
  uint32_t MemoryType;                   // Specifies the type of external memory attached to the corresponding memory device. This parameter can be a value of @ref FMC_Memory_Type
  uint32_t MemoryDataWidth;              // Specifies the external memory device width. This parameter can be a value of @ref FMC_NORSRAM_Data_Width
  uint32_t BurstAccessMode;              // Enables or disables the burst access mode for Flash memory, valid only with synchronous burst Flash memories. This parameter can be a value of @ref FMC_Burst_Access_Mode
  uint32_t WaitSignalPolarity;           // Specifies the wait signal polarity, valid only when accessing the Flash memory in burst mode. This parameter can be a value of @ref FMC_Wait_Signal_Polarity
  uint32_t WaitSignalActive;             // Specifies if the wait signal is asserted by the memory one clock cycle before the wait state or during the wait state, valid only when accessing memories in burst mode. This parameter can be a value of @ref FMC_Wait_Timing This parameter can be a value of @ref FMC_Write_Operation
  uint32_t WaitSignal;                   // Enables or disables the wait state insertion via wait signal, valid for Flash memory access in burst mode. This parameter can be a value of @ref FMC_Wait_Signal
  uint32_t ExtendedMode;                 // Enables or disables the extended mode. This parameter can be a value of @ref FMC_Extended_Mode
  uint32_t AsynchronousWait;             // Enables or disables wait signal during asynchronous transfers, valid only with asynchronous Flash memories. This parameter can be a value of @ref FMC_AsynchronousWait
  uint32_t WriteBurst;                   // Enables or disables the write burst operation. This parameter can be a value of @ref FMC_Write_Burst
  uint32_t ContinuousClock;              // Enables or disables the FMC clock output to external memory devices. This parameter is only enabled through the FMC_BCR1 register, and don't care through FMC_BCR2..4 registers. This parameter can be a value of @ref FMC_Continous_Clock
  uint32_t WriteFifo;                    // Enables or disables the write FIFO used by the FMC controller. This parameter is only enabled through the FMC_BCR1 register, and don't care through FMC_BCR2..4 registers. This parameter can be a value of @ref FMC_Write_FIFO
  uint32_t PageSize;                     // Specifies the memory page size. This parameter can be a value of @ref FMC_Page_Size

