aroyer-qc/Digini/Peripheral/inc/port/STM32F4xx/lib_class_STM32F4_fmc.h
// Enable the NORSRAM device access.
#define __FMC_NORSRAM_ENABLE(__INSTANCE__, __BANK__)  ((__INSTANCE__)->BTCR[(__BANK__)] |= FMC_BCR1_MBKEN)

// Disable the NORSRAM device access.
#define __FMC_NORSRAM_DISABLE(__INSTANCE__, __BANK__) ((__INSTANCE__)->BTCR[(__BANK__)] &= ~FMC_BCR1_MBKEN)

// Enable the NAND device access.
#define __FMC_NAND_ENABLE(__INSTANCE__)  ((__INSTANCE__)->PCR |= FMC_PCR_PBKEN)

// Disable the NAND device access.
#define __FMC_NAND_DISABLE(__INSTANCE__) ((__INSTANCE__)->PCR &= ~FMC_PCR_PBKEN)

//  Enable the NAND device interrupt.
//   This parameter can be any combination of the following values:
//   FMC_IT_RISING_EDGE: Interrupt rising edge.
//   FMC_IT_LEVEL: Interrupt level.
//   FMC_IT_FALLING_EDGE: Interrupt falling edge.
//	retval None
#define __FMC_NAND_ENABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->SR |= (__INTERRUPT__))

//  Disable the NAND device interrupt.
//  This parameter can be any combination of the following values:
//   FMC_IT_RISING_EDGE: Interrupt rising edge.
//   FMC_IT_LEVEL: Interrupt level.
//   FMC_IT_FALLING_EDGE: Interrupt falling edge.
//  retval None
  */
#define __FMC_NAND_DISABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->SR &= ~(__INTERRUPT__))

/**
  * @brief  Get flag status of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __BANK__     FMC_NAND Bank
  * @param  __FLAG__ FMC_NAND flag
  *         This parameter can be any combination of the following values:
  *            @arg FMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg FMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg FMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg FMC_FLAG_FEMPT: FIFO empty flag.
  * @retval The state of FLAG (SET or RESET).
  */
#define __FMC_NAND_GET_FLAG(__INSTANCE__, __BANK__, __FLAG__)  (((__INSTANCE__)->SR &(__FLAG__)) == (__FLAG__))

/**
  * @brief  Clear flag status of the NAND device.
  * @param  __INSTANCE__ FMC_NAND Instance
  * @param  __FLAG__ FMC_NAND flag
  *         This parameter can be any combination of the following values:
  *            @arg FMC_FLAG_RISING_EDGE: Interrupt rising edge flag.
  *            @arg FMC_FLAG_LEVEL: Interrupt level edge flag.
  *            @arg FMC_FLAG_FALLING_EDGE: Interrupt falling edge flag.
  *            @arg FMC_FLAG_FEMPT: FIFO empty flag.
  * @retval None
  */
#define __FMC_NAND_CLEAR_FLAG(__INSTANCE__, __FLAG__)  ((__INSTANCE__)->SR &= ~(__FLAG__))

/**
  * @brief  Enable the SDRAM device interrupt.
  * @param  __INSTANCE__ FMC_SDRAM instance
  * @param  __INTERRUPT__ FMC_SDRAM interrupt
  *         This parameter can be any combination of the following values:
  *            @arg FMC_IT_REFRESH_ERROR: Interrupt refresh error
  * @retval None
  */
#define __FMC_SDRAM_ENABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->SDRTR |= (__INTERRUPT__))

/**
  * @brief  Disable the SDRAM device interrupt.
  * @param  __INSTANCE__ FMC_SDRAM instance
  * @param  __INTERRUPT__ FMC_SDRAM interrupt
  *         This parameter can be any combination of the following values:
  *            @arg FMC_IT_REFRESH_ERROR: Interrupt refresh error
  * @retval None
  */
#define __FMC_SDRAM_DISABLE_IT(__INSTANCE__, __INTERRUPT__)  ((__INSTANCE__)->SDRTR &= ~(__INTERRUPT__))

/**
  * @brief  Get flag status of the SDRAM device.
  * @param  __INSTANCE__ FMC_SDRAM instance
  * @param  __FLAG__ FMC_SDRAM flag
  *         This parameter can be any combination of the following values:
  *            @arg FMC_SDRAM_FLAG_REFRESH_IT: Interrupt refresh error.
  *            @arg FMC_SDRAM_FLAG_BUSY: SDRAM busy flag.
  *            @arg FMC_SDRAM_FLAG_REFRESH_ERROR: Refresh error flag.
  * @retval The state of FLAG (SET or RESET).
  */
#define __FMC_SDRAM_GET_FLAG(__INSTANCE__, __FLAG__)  (((__INSTANCE__)->SDSR &(__FLAG__)) == (__FLAG__))

/**
  * @brief  Clear flag status of the SDRAM device.
  * @param  __INSTANCE__ FMC_SDRAM instance
  * @param  __FLAG__ FMC_SDRAM flag
  *         This parameter can be any combination of the following values:
  *           @arg FMC_SDRAM_FLAG_REFRESH_ERROR
  * @retval None
  */
#define __FMC_SDRAM_CLEAR_FLAG(__INSTANCE__, __FLAG__)  ((__INSTANCE__)->SDRTR |= (__FLAG__))

//-------------------------------------------------------------------------------------------------
// class definition(s)
//-------------------------------------------------------------------------------------------------

class FMC_Driver
{
    public:

      #ifdef FMC_USE_LCD_MODULE
        // LCD Initialization
        void            LCD_Initialize                  (FMC_SDRAM_t* Device, FMC_SDRAM_Init_t* Init);
        void            LCD_TimingInit                  (FMC_SDRAM_Timing_t* Timing, uint32_t Bank);

        // LCD Control functions
        void            SDRAM_WriteProtectionEnable     (uint32_t Bank);
        void            SDRAM_WriteProtectionDisable    (uint32_t Bank);
        void            SDRAM_SendCommand               (FMC_SDRAM_Command_t* Command, uint32_t Timeout);
        void            SDRAM_ProgramRefreshRate        (uint32_t RefreshRate);
        void            SDRAM_SetAutoRefreshNumber      (uint32_t AutoRefreshNumber);
        uint32_t        SDRAM_GetModeStatus             (uint32_t Bank);
      #endif

      #ifdef FMC_USE_NAND_MODULE
        // NAND Initialization
        void            NAND_Initialize                 (FMC_NAND_t* Device, FMC_NAND_Init_t* Init);
        void            NAND_CommonSpaceTimingInit      (FMC_NAND_PCC_Timing_t* Timing, uint32_t Bank);
        void            NAND_AttributeSpaceTimingInit   (FMC_NAND_PCC_Timing_t* Timing, uint32_t Bank);

        // NAND Control functions
        void            NAND_ECC_Enable                 (void);
        void            NAND_ECC_Disable                (void);
        SystemState_e   NAND_GetECC                     (uint32_t* ECCval, uint32_t Bank, uint32_t Timeout);
      #endif

      #ifdef FMC_USE_NOR_MODULE
        // NOR SRAM Initialization/de-initialization functions
        void            NORSRAM_Initialize              (FMC_NORSRAM_t* Device, FMC_NORSRAM_Init_t* Init);
        void            NORSRAM_TimingInit              (FMC_NORSRAM_Timing_t* Timing, uint32_t Bank);
        void            NORSRAM_ExtendedTimingInit      (FMC_NORSRAM_EXTENDED_t* Device, FMC_NORSRAM_Timing_t* Timing, uint32_t Bank, uint32_t ExtendedMode);

