aroyer-qc/Digini/Peripheral/inc/port/STM32F4xx/lib_class_STM32F4_fmc.h
        // SRAM Control functions
        void            NORSRAM_WriteOperationEnable    (uint32_t Bank);
        void            NORSRAM_WriteOperationDisable   (uint32_t Bank);
      #endif

      #ifdef FMC_USE_SRAM_MODULE
      #endif

      #ifdef FMC_USE_SDRAM_MODULE
        // SDRAM Initialization
        void            SDRAM_Initialize                (FMC_SDRAM_t* Device, FMC_SDRAM_Init_t* Init);
        void            SDRAM_TimingInit                (FMC_SDRAM_Timing_t* Timing, uint32_t Bank);

        // SDRAM Control functions
        void            SDRAM_WriteProtectionEnable     (uint32_t Bank);
        void            SDRAM_WriteProtectionDisable    (uint32_t Bank);
        void            SDRAM_SendCommand               (FMC_SDRAM_Command_t* Command, uint32_t Timeout);
        void            SDRAM_ProgramRefreshRate        (uint32_t RefreshRate);
        void            SDRAM_SetAutoRefreshNumber      (uint32_t AutoRefreshNumber);
        uint32_t        SDRAM_GetModeStatus             (uint32_t Bank);
      #endif

    private:

      #ifdef FMC_USE_LCD_MODULE
        FMC_SDRAM_t*        m_pLCD_Device;
      #endif

      #ifdef FMC_USE_NAND_MODULE
         FMC_NAND_t*        m_pNAND_Device;
      #endif

      #ifdef FMC_USE_NOR_MODULE
        FMC_NORSRAM_t*      m_pNORSRAM_Device;
      #endif

      #ifdef FMC_USE_SDRAM_MODULE
        FMC_SDRAM_t*        m_pSDRAM_Device;
      #endif
      
	  #ifdef FMC_USE_SRAM_MODULE
        FMC_SRAM_t*       	m_pSRAM_Device;
      #endif

};

//-------------------------------------------------------------------------------------------------

#endif
